---
title: ModelCurveArrArray
classe: Autodesk.Revit.DB.ModelCurveArrArray
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# ModelCurveArrArray

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `modelCurveArrArray.IsEmpty` | Boolean |
| `ModelCurveArray Item { get; set; }` | `modelCurveArrArray.Item` | ModelCurveArray |
| `Int32 Size { get; }` | `modelCurveArrArray.Size` | Int32 |
| `Void Append(ModelCurveArray)` | `modelCurveArrArray.Append(item)` | Void |
| `Void Clear()` | `modelCurveArrArray.Clear()` | Void |
| `ModelCurveArrArrayIterator ForwardIterator()` | `modelCurveArrArray.ForwardIterator()` | ModelCurveArrArrayIterator |
| `IEnumerator GetEnumerator()` | `modelCurveArrArray.GetEnumerator()` | IEnumerator |
| `Void Insert(ModelCurveArray, Int32)` | `modelCurveArrArray.Insert(item, index)` | Void |
| `ModelCurveArrArrayIterator ReverseIterator()` | `modelCurveArrArray.ReverseIterator()` | ModelCurveArrArrayIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```